Repository: WebTrit/webtrit_phone
Catalog: lib/l10n/arb/app_*.arb
Languages: it, uk

# account_selfCarePasswordExpired_message
source: Your self-care password has expired. Please update it using your self-care. Until the password is changed, access to the service will be limited.
it: La tua password di self-care è scaduta. Ti preghiamo di aggiornarla utilizzando il self-care. Fino a quando la password non sarà cambiata, l'accesso al servizio sarà limitato.
uk: Термін дії вашого пароля самообслуговування минув. Оновіть його за допомогою самообслуговування. Доки пароль не буде змінено, доступ до служби буде обмежено.

# alertDialogActions_no
source: No
uk: Ні

# alertDialogActions_ok
source: Ok
uk: Ок

# alertDialogActions_yes
source: Yes
it: Si
uk: Так

# autoprovision_errorSnackBar_invalidToken
source: The autoconfiguration credentials were rejected by the server. Please request a new configuration link
it: Le credenziali di configurazione automatica sono state rifiutate dal server. Richiedi nuovamente le credenziali
uk: Автоматичні облікові дані для конфігурації були відхилені сервером. Будь ласка, подайте запит на нове посилання на конфігурацію.

# autoprovision_ReloginDialog_confirm
source: Confirm
it: Confermare
uk: Підтвердити

# autoprovision_ReloginDialog_decline
source: Decline
it: Rifiuto
uk: Відмовитися

# autoprovision_ReloginDialog_text
source: Do you want to use the new authentication credentials provided in the link? You will be logged out from the current session.
it: Vuoi usare le nuove credenziali di accesso?, Utilizza il seguente link, verrai automaticamente disconnesso da questa sessione
uk: Ви хочете використати нові облікові дані для аутентифікації, надані у посиланні? Поточна сесія буде завершена.

# autoprovision_ReloginDialog_title
source: Relogin Confirmation
it: Conferma di nuovo accesso
uk: Підтвердження повторного входу

# autoprovision_successSnackBar_used
source: Successfully retrieved your settings, your app is ready to use
it: Le vostre impostazioni sono state recuperate con successo, l'App è pronta per l'uso
uk: Ваші налаштування було успішно отримано, додаток готовий до використання

# call_CallActionsTooltip_accept
source: Accept
it: Accetta chiamata
uk: Прийняти

# call_CallActionsTooltip_accept_inviteToAttendedTransfer
source: Accept transfer
it: Accetta trasferimento
uk: Прийняти переадресацію

# call_CallActionsTooltip_attended_transfer
source: Attended transfer
it: Trasferimento assistito
uk: Керована переадресація

# call_CallActionsTooltip_decline_inviteToAttendedTransfer
source: Decline transfer
it: Rifiuta trasferimento
uk: Відхилити переадресацію

# call_CallActionsTooltip_disableCamera
source: Disable camera
it: Disattiva video
uk: Вимкнути камеру

# call_CallActionsTooltip_disableSpeaker
source: Disable speakerphone
it: Disattiva vivavoce
uk: Вимкнути динамік

# call_CallActionsTooltip_enableCamera
source: Enable camera
it: Attiva video
uk: Увімкнути камеру

# call_CallActionsTooltip_enableSpeaker
source: Enable speakerphone
it: Attiva vivavoce
uk: Увімкнути динамік

# call_CallActionsTooltip_hangup
source: Hangup
it: Termina chiamata
uk: Завершити

# call_CallActionsTooltip_hangupAndAccept
source: Hangup & Accept
it: Riagganciare e accettare
uk: Завершити та прийняти

# call_CallActionsTooltip_hideKeypad
source: Hide keypad
it: Nascondi tastiera
uk: Приховати клавіатуру

# call_CallActionsTooltip_hold
source: Hold call
it: Attesa
uk: Утримати дзвінок

# call_CallActionsTooltip_holdAndAccept
source: Hold & Accept
it: Tenere in attesa e accettare
uk: Утримати та прийняти

# call_CallActionsTooltip_mute
source: Mute microphone
it: Disattiva il microfono
uk: Вимкнути мікрофон

# call_CallActionsTooltip_showKeypad
source: Show keypad
it: Mostra tastiera
uk: Показати клавіатуру

# call_CallActionsTooltip_swap
source: Swap calls
it: Scambio chiamate
uk: Перемкнути дзвінки

# call_CallActionsTooltip_transfer
source: Transfer
it: Trasferimento
uk: Переадресація

# call_CallActionsTooltip_transfer_choose
source: Choose number
it: Scegliere il numero
uk: Вибрати номер

# call_CallActionsTooltip_unattended_transfer
source: Unattended transfer
it: Trasferimento non assistito
uk: Некерована переадресація

# call_CallActionsTooltip_unhold
source: Unhold call
it: Ripresa chiamata
uk: Поновити дзвінок

# call_CallActionsTooltip_unmute
source: Unmute microphone
it: Attiva il microfono
uk: Увімкнути мікрофон

# call_description_held
source: On hold
it: In attesa
uk: На утриманні

# call_description_incoming
source: Incoming call
it: Chiamata in arrivo
uk: Вхідний дзвінок

# call_description_inviteToAttendedTransfer
source: You've been invited to join an attended transfer call
it: Sei stato invitato a unirti a una chiamata di trasferimento assistito
uk: Вас запросили приєднатися до керованої переадресації

# call_description_outgoing
source: Outgoing call
it: Chiamata in corso
uk: Вихідний дзвінок

# call_description_requestToAttendedTransfer
source: Transfer request
it: Richiesta di trasferimento
uk: Запит на переадресацію

# call_description_transferProcessing
source: Transfer processing
it: Elaborazione del trasferimento
uk: Обробка переадресації

# call_FailureAcknowledgeDialog_title
source: Failure
it: Guasto
uk: Помилка

# callProcessingStatus_answering
source: Answering the call, please hold on…
it: Rispondendo alla chiamata, attendi prego…
uk: Прийняття виклику, будь ласка, зачекайте…

# callProcessingStatus_disconnecting
source: Disconnecting the call, please hold on…
it: Desconectando la llamada, por favor espere…
uk: Відключення дзвінка, будь ласка, зачекайте…

# callStatus_appUnregistered
source: Unregistered
it: Non registrato
uk: Незареєстровано

# callStatus_connectError
source: Connection error
it: Errore di connessione
uk: Помилка підключення

# callStatus_connectIssue
source: Connection issue
it: Problemi di connessione
uk: Проблема з'єднання

# callStatus_connectivityNone
source: No internet connection
it: Nessuna connessione internet
uk: Немає інтернет-з'єднання

# callStatus_inProgress
source: Connection in progress
it: Connessione in corso
uk: Процес підключення

# callStatus_ready
source: Connection established
it: Connessione stabilita
uk: Підключення встановлено

# call_ThumbnailAvatar_currentlyNoActiveCall
source: Currently, there is no active call
it: Actualmente, no hay ninguna llamada activa
uk: Зараз немає активних дзвінків

# common_noInternetConnection_message
source: It seems you are not connected to the internet. Please check your connection and try again.
it: Sembra che tu non sia connesso a Internet. Controlla la tua connessione e riprova.
uk: Схоже, ви не підключені до Інтернету. Перевірте своє підключення і спробуйте ще раз.

# common_noInternetConnection_retryButton
source: Try Again
it: Riprova
uk: Спробуйте ще раз

# common_noInternetConnection_title
source: No Internet Connection
it: Nessuna connessione Internet
uk: Немає підключення до Інтернету

# common_problemWithLoadingPage
source: There was an issue loading the page.
it: Si è verificato un problema durante il caricamento della pagina.
uk: Виникла проблема з завантаженням сторінки.

# contacts_ExternalTabButton_refresh
source: Refresh
uk: Оновити

# contacts_ExternalTabText_empty
source: No contacts
it: Nessun contatto
uk: Немає контактів

# contacts_ExternalTabText_emptyOnSearching
source: No contacts found
it: Nessun contatto trovato
uk: Контакти не знайдено

# contacts_ExternalTabText_failure
source: Failed to get cloud PBX contacts
it: Impossibile ottenere i contatti del centralino cloud
uk: Не вдалося отримати контакти з хмарного PBX

# contacts_LocalTabButton_openAppSettings
source: Grant access to your phone contacts
uk: Надати доступ до контактів вашого телефону

# contacts_LocalTabButton_refresh
source: Refresh
uk: Оновити

# contacts_LocalTabText_empty
source: No contacts
it: Nessun contatto
uk: Немає контактів

# contacts_LocalTabText_emptyOnSearching
source: No contacts found
it: Nessun contatto trovato
uk: Контакти не знайдено

# contacts_LocalTabText_failure
source: Failed to get your phone contacts
it: Impossibile ottenere i tuoi contatti telefonici
uk: Не вдалося отримати контакти з вашого телефону

# contacts_LocalTabText_permissionFailure
source: There are no permissions to get your phone contacts
it: Non ci sono i permessi per ottenere i tuoi contatti telefonici
uk: Відсутні дозволи для доступу до контактів вашого телефону

# contactsSourceExternal
source: Cloud PBX
it: Centralino cloud
uk: Хмарний PBX

# contactsSourceLocal
source: Your phone
it: Il tuo telefono
uk: Ваш телефон

# contacts_Text_blingTransferInitiated
source: Performing blind transfer
it: Trasferimento senza vedere
uk: Безумовне переведення дзвінка

# copyToClipboard_floatingSnackBar
source: Text copied
it: Testo copiato
uk: Текст скопійовано

# copyToClipboard_popupMenuItem
source: Copy to clipboard
it: Copia negli appunti
uk: Скопіювати в буфер обміну

# default_CannotRemoveOwnerMessagingSocketException
source: Cannot remove owner
it: Impossibile rimuovere il proprietario
uk: Неможливо видалити власника

# default_ChatMemberNotFoundMessagingSocketException
source: Chat member not found
it: Membro della chat non trovato
uk: Учасника чату не знайдено

# default_ChatNotFoundMessagingSocketException
source: Chat not found
it: Chat non trovata
uk: Чат не знайдено

# default_ClientExceptionError
source: A HTTP client issue occurred
it: Si è verificato un problema con il client HTTP
uk: Сталася проблема з клієнтом HTTP

# default_ErrorDetails
source: Details
it: Dettagli dell'errore
uk: Деталі помилки

# default_ErrorMessage
source: Error message
it: Messaggio di errore
uk: Повідомлення про помилку

# default_ErrorPath
source: Error path
uk: Шлях помилки

# default_ErrorTransactionId
source: Transaction ID
it: ID transazione
uk: Ідентифікатор транзакції

# default_ForbiddenMessagingSocketException
source: Forbidden request
it: Vietato
uk: Доступ заборонено

# default_FormatExceptionError
source: A response format issue occurred
it: Si è verificato un problema di formato della risposta
uk: Виникла проблема формату відповіді

# default_InternalErrorMessagingSocketException
source: Internal server error
it: Errore interno del server
uk: Внутрішня помилка сервера

# default_InvalidChatTypeMessagingSocketException
source: Invalid chat type
it: Tipo di chat non valido
uk: Недійсний тип чату

# default_MessagingSocketException
source: An error occurred while processing the request
it: Si è verificato un errore durante la comunicazione con il server
uk: Сталася помилка при обробці запиту

# default_RequestFailureError
source: A server failure occurred
it: Si è verificato un errore del server
uk: Сталася помилка на сервері

# default_SelfAuthorityAssignmentForbiddenMessagingSocketException
source: Self authority assignment is forbidden
it: Assegnazione di autorità a se stessi vietata
uk: Призначення власних прав заборонено

# default_SelfRemovalForbiddenMessagingSocketException
source: Self removal is forbidden
it: Rimozione di se stessi vietata
uk: Видалення себе заборонено

# default_SmsConversationNotFoundMessagingSocketException
source: SMS conversation not found
it: Conversazione SMS non trovata
uk: SMS-розмову не знайдено

# default_TimeoutExceptionError
source: A server timeout occurred
it: Si è verificato un problema di timeout del server
uk: Сталася проблема з таймаутом сервера

# default_TimeoutMessagingSocketException
source: The request has timed out
it: Tempo di attesa scaduto
uk: Час очікування відповіді сервера вичерпано

# default_TlsExceptionError
source: A secure network protocol (TLS/SSL) issue occurred
it: Si è verificato un problema con il protocollo di rete sicuro (TLS/SSL)
uk: Виникла проблема з безпековим мережевим протоколом (TLS/SSL)

# default_TypeErrorError
source: A response issue occurred
it: Si è verificato un problema di risposta
uk: Виникла проблема з відповіддю

# default_UnauthorizedMessagingSocketException
source: Unauthorized request
it: Non autorizzato
uk: Помилка авторизації

# default_UnauthorizedRequestFailureError
source: An unauthorized request failure occurred
it: Si è verificato un errore di richiesta non autorizzata
uk: Сталася помилка несанкціонованого запиту

# default_UserAlreadyInChatMessagingSocketException
source: User is already in chat
it: Utente già nella chat
uk: Користувач вже в чаті

# diagnostic_AppBar_title
source: Diagnostic
it: Diagnostica
uk: Діагностика

# diagnostic_battery_groupTitle
source: Battery
it: Batteria
uk: Батарея

# diagnostic_batteryMode_optimized_description
source: The app's background activity is managed by the system to save the battery. It may not work correctly with incoming calls triggered by push notifications.
it: L'attività in background dell'app è gestita dal sistema per risparmiare batteria. Potrebbe non funzionare correttamente con chiamate in arrivo attivate da notifiche push.
uk: Фонова активність додатка керується системою для економії батареї. Може працювати некоректно для вхідних дзвінків, що активуються через push-сповіщення.

# diagnostic_batteryMode_optimized_title
source: Optimized
it: Ottimizzato
uk: Оптимізовано

# diagnostic_batteryMode_restricted_description
source: The app's background activity is heavily restricted to conserve the battery. Incoming calls may be missed.
it: L'attività in background dell'app è fortemente limitata per conservare la batteria. Potrebbero essere perse chiamate in arrivo.
uk: Фонова активність додатка обмежена для економії заряду батареї. Вхідні дзвінки можуть бути пропущені.

# diagnostic_batteryMode_restricted_title
source: Restricted
it: Limitato
uk: Обмежено

# diagnostic_batteryMode_unknown_description
source: The battery mode status is unknown. The app might have unpredictable behavior.
it: Lo stato della modalità batteria è sconosciuto. L'app potrebbe avere un comportamento imprevedibile.
uk: Статус режиму батареї невідомий. Додаток може поводитися непередбачувано.

# diagnostic_batteryMode_unknown_title
source: Unknown
it: Sconosciuto
uk: Невідомо

# diagnostic_batteryMode_unrestricted_description
source: The app has full access to run in the background without restrictions.
it: L'app ha pieno accesso per funzionare in background senza restrizioni.
uk: Додаток має повний доступ для роботи у фоновому режимі без обмежень.

# diagnostic_batteryMode_unrestricted_title
source: Unrestricted
it: Senza restrizioni
uk: Без обмежень

# diagnostic_battery_navigate_section
source: Navigate to the Battery section
it: Vai alla sezione Batteria
uk: Перейдіть до розділу «Батарея»

# diagnostic_battery_tile_title
source: Battery mode
it: Modalità batteria
uk: Режим батареї

# diagnostic_permission_camera_description
source: This app requires permission to access the camera to make video calls.
it: Questa app richiede il permesso di accedere alla fotocamera per effettuare videochiamate.
uk: Цей додаток потребує дозволу на доступ до камери для здійснення відеодзвінків.

# diagnostic_permission_camera_title
source: Camera
it: Fotocamera
uk: Камера

# diagnostic_permission_contacts_description
source: This app requires permission to access contacts to make calls within your address book.
it: Questa app richiede il permesso di accedere ai contatti per effettuare chiamate dalla tua rubrica.
uk: Цей додаток потребує дозволу на доступ до контактів для здійснення дзвінків із вашої телефонної книги.

# diagnostic_permission_contacts_title
source: Contacts
it: Contatti
uk: Контакти

# diagnosticPermissionDetails_button_managePermission
source: Manage Permission
it: Gestisci permessi
uk: Керування дозволами

# diagnosticPermissionDetails_button_requestPermission
source: Request Permission
it: Richiedi permesso
uk: Запит дозволу

# diagnosticPermissionDetails_title_statusPermission
source: Status permission
it: Stato del permesso
uk: Статус дозволу

# diagnostic_permission_microphone_description
source: This app requires permission to access the microphone to make audio calls.
it: Questa app richiede il permesso di accedere al microfono per effettuare chiamate audio.
uk: Цей додаток потребує дозволу на доступ до мікрофона для здійснення аудіодзвінків.

# diagnostic_permission_microphone_title
source: Microphone
it: Microfono
uk: Мікрофон

# diagnostic_permission_notification_description
source: Enables the app to trigger incoming call.
it: Permette all'app di attivare le chiamate in arrivo.
uk: Дозволяє додатку активувати вхідні дзвінки.

# diagnostic_permission_notification_title
source: Notification
it: Notifiche
uk: Сповіщення

# diagnostic_permissionStatus_denied
source: Access Denied
it: Accesso negato
uk: Доступ заборонено

# diagnostic_permissionStatus_granted
source: Access Granted
it: Accesso consentito
uk: Доступ надано

# diagnostic_permissionStatus_limited
source: Limited Access
it: Accesso limitato
uk: Обмежений доступ

# diagnostic_permissionStatus_permanentlyDenied
source: Access Permanently Denied
it: Accesso permanentemente negato
uk: Доступ назавжди заборонено

# diagnostic_permissionStatus_provisional
source: Provisional Access
it: Accesso provvisorio
uk: Тимчасовий доступ

# diagnostic_permissionStatus_restricted
source: Restricted Access
it: Accesso limitato
uk: Обмежений доступ

# diagnosticPushDetails_configuration_title
source: Push Notification service configuration
it: Configurazione del servizio di notifiche push
uk: Налаштування служби push-сповіщень

# diagnosticPushDetails_errorMessage_intro
source: Some steps to try:
it: Alcuni passi da provare:
uk: Декілька кроків, які можна спробувати:

# diagnosticPushDetails_errorMessage_step1
source: 1. Ensure your phone is connected to the internet.
it: 1. Assicurati che il telefono sia connesso a Internet.
uk: 1. Переконайтеся, що ваш телефон підключений до Інтернету.

# diagnosticPushDetails_errorMessage_step2
source: 2. If connected, check that your phone can access Google services by visiting a website.
it: 2. Se connesso, verifica che il telefono possa accedere ai servizi Google visitando un sito web.
uk: 2. Якщо підключено, перевірте, чи може ваш телефон отримати доступ до сервісів Google, відвідавши веб-сайт.

# diagnosticPushDetails_errorMessage_step3
source: 3. Wait a few minutes and try again – Firebase messaging servers may be temporarily down.
it: 3. Aspetta qualche minuto e riprova – i server di messaggistica Firebase potrebbero essere temporaneamente inattivi.
uk: 3. Зачекайте кілька хвилин і спробуйте знову – сервери Firebase можуть тимчасово не працювати.

# diagnosticPushDetails_errorMessage_step4
source: 4. Restart Google Play services to ensure they are functioning correctly.
it: 4. Riavvia i servizi di Google Play per assicurarne il corretto funzionamento.
uk: 4. Перезапустіть сервіси Google Play, щоб переконатися, що вони працюють належним чином.

# diagnosticPushDetails_errorMessage_step5
source: 5. Verify that Google Play services are installed on your device.
it: 5. Verifica che i servizi di Google Play siano installati sul tuo dispositivo.
uk: 5. Переконайтеся, що сервіси Google Play встановлені на вашому пристрої.

# diagnosticPushDetails_successMessage
source: The notification service is successfully configured and ready for use to receive messages and handle incoming calls.
it: Il servizio di notifica è stato configurato con successo ed è pronto per l’uso per ricevere messaggi e gestire le chiamate in arrivo.
uk: Служба сповіщень успішно налаштована та готова до використання для отримання повідомлень і обробки вхідних дзвінків.

# diagnostic_pushTokenStatusType_progress
source: In progress
it: In corso
uk: В процесі

# diagnostic_pushTokenStatusType_success
source: Service successfully configured
it: Servizio configurato con successo
uk: Службу успішно налаштовано

# diagnosticScreen_permissionsGroup_title
source: Permissions
it: Permessi
uk: Дозволи

# diagnosticScreen_pushNotificationService_title
source: Push notification service
it: Servizio di notifiche push
uk: Служба push-сповіщень

# favorites_BodyCenter_empty
source: Currently, you have no favorite numbers. Add favorites from Contacts using the star icon
it: Al momento non hai numeri preferiti. Aggiungi ai preferiti dai Contatti usando l'icona a stella
uk: Наразі у вас немає обраних номерів. Додайте обрані номери з Контактів, використовуючи іконку "зірочка"

# favorites_DeleteConfirmDialog_content
source: Are you sure you want to delete the current favorite number?
it: Sei sicuro di voler eliminare il contatto preferito?
uk: Ви впевнені, що хочете видалити поточний обраний номер?

# favorites_DeleteConfirmDialog_title
source: Confirm deleting
it: Confermare l'eliminazione
uk: Підтвердити видалення

# favorites_SnackBar_deleted
source: {name} deleted
it: {name} cancellato
uk: {name} видалено

# favorites_Text_blingTransferInitiated
source: Performing blind transfer
it: Trasferimento senza vedere
uk: Безумовне переведення дзвінка

# locale_default
source: Default
it: Predefinito
uk: За замовчуванням

# locale_en
source: English
it: Inglese
uk: Англійська

# locale_it
source: Italian
it: Italiano
uk: Італійська

# locale_uk
source: Ukrainian
it: Ucraino
uk: Українська

# login_Button_coreUrlAssignProceed
source: Proceed
it: Procedi
uk: Продовжити

# login_Button_otpSigninRequestProceed
source: Proceed
it: Procedi
uk: Продовжити

# login_Button_otpSigninVerifyProceed
source: Verify
it: Verifica
uk: Перевірити

# login_Button_otpSigninVerifyRepeat
source: Resend the code
it: Invia di nuovo il codice
uk: Повторно надіслати код

# login_Button_otpSigninVerifyRepeatInterval
source: Resend the code ({seconds} s)
it: Invia di nuovo il codice ({seconds} s)
uk: Повторно надіслати код ({seconds} с)

# login_Button_passwordSigninProceed
source: Proceed
it: Procedi
uk: Продовжити

# login_Button_signIn
source: Sign in
it: Registrazione
uk: Увійти

# login_Button_signupRequestProceed
source: Proceed
it: Procedi
uk: Продовжити

# login_Button_signUpToDemoInstance
source: Sign up
it: Iscrizione
uk: Зареєструватися

# login_Button_signupVerifyProceed
source: Verify
it: Verifica
uk: Перевірити

# login_Button_signupVerifyRepeat
source: Resend the code
it: Invia di nuovo il codice
uk: Повторно надіслати код

# login_Button_signupVerifyRepeatInterval
source: Resend the code ({seconds} s)
it: Invia di nuovo il codice ({seconds} s)
uk: Повторно надіслати код ({seconds} с)

# login_ButtonTooltip_signInToYourInstance
source: Sign in to your WebTrit Cloud Backend
it: Accedi al tuo WebTrit Cloud Backend
uk: Увійти до свого WebTrit Cloud Backend

# login_CoreVersionUnsupportedExceptionError
source: An incompatible instance version provided, please contact the administrator of your system (actual: {actual}, supported: {supportedConstraint})
it: È stata fornita una versione di richiesta incompatibile, contattare l'amministratore del sistema (actual:{actual}, supported:{supportedConstraint})
uk: Непідтримувана версія екземпляра, будь ласка, зверніться до адміністратора вашої системи (фактична: {actual}, підтримувана: {supportedConstraint})

# login_RequestFailureEmptyEmailError
source: Cannot send the verification code
it: Impossibile inviare il codice di verifica
uk: Не вдалося відправити код підтвердження

# login_RequestFailureIdentifierIsNotValid
source: The identifier is invalid or does not exist
it: Il tuo ID risulta non valido perché inesistente
uk: Ідентифікатор недійсний, або не існує

# login_RequestFailureIncorrectOtpCodeError
source: Incorrect verification code
it: Codice di verifica errato
uk: Невірний код підтвердження

# login_RequestFailureOtpAlreadyVerifiedError
source: Verification already verified
it: Verifica già verificata
uk: Перевірка вже пройдена

# login_RequestFailureOtpExpiredError
source: Verification expired
it: Verifica scaduta
uk: Термін дії перевірки закінчився

# login_RequestFailureOtpNotFoundError
source: Verification not found
it: Verifica non trovata
uk: Код верифікації не знайдено
