Repository: WebTrit/webtrit_phone
Catalog: lib/l10n/arb/app_*.arb
Languages: it, uk

# login_RequestFailureOtpVerificationAttemptsExceededError
source: Verification attempts exceeded
it: Tentativi di verifica superati
uk: Перевищено кількість спроб підтвердження

# login_RequestFailureParametersApplyIssueError
source: Provided data can't be processed
it: I dati forniti non possono essere elaborati
uk: Надані дані не можуть бути оброблені

# login_RequestFailurePhoneNotFoundError
source: Phone number not found
it: Numero di telefono non trovato
uk: Номер телефону не знайдено

# login_RequestFailureUnconfiguredBundleIdError
source: The app is not supported by your WebTrit Cloud Backend
it: Errore di configurazione del backend dell'app - avvisare il proprio fornitore di servizi
uk: Помилка конфігурації сервера додатка - сповістіть свого постачальника послуг

# login_SupportedLoginTypeMissedExceptionError
source: The current WebTrit Cloud Backend does not support any login types compatible with this app
it: L'attuale Backend Cloud di WebTrit non supporta nessun tipo di accesso compatibile con questa app
uk: Поточний WebTrit Cloud Backend не підтримує жодного типу входу, сумісного з цим додатком

# login_Text_coreUrlAssignPostDescription
source: If you do not yet have your own WebTrit Cloud Backend - contact sales team {email}.
it: Se non hai ancora il tuo proprio WebTrit Cloud Backend, contatta il team vendite all'indirizzo {email}
uk: Якщо у вас ще немає власного екземпляра WebTrit Cloud Backend, зв'яжіться з відділом продажів за адресою {email}.

# login_Text_coreUrlAssignPreDescription
source: In order to make calls via your own VoIP system please enter the URL of WebTrit Cloud Backend (as it was provided to you by your account manager) below.
it: Per effettuare chiamate tramite il tuo sistema VoIP, inserisci l'URL di WebTrit Cloud Backend (come fornito dal tuo account manager) di seguito.
uk: Щоб робити дзвінки через вашу власну систему VoIP, будь ласка, введіть URL WebTrit Cloud Backend (як це було надано вашим менеджером) нижче.

# login_TextFieldLabelText_coreUrlAssign
source: Enter your WebTrit Cloud Backend URL
it: Inserisci l'URL del tuo WebTrit Cloud Backend
uk: Введіть URL вашого WebTrit Cloud Backend

# login_TextFieldLabelText_otpSigninCode
source: Enter the verification code
it: Inserisci il codice di verifica
uk: Введіть код підтвердження

# login_TextFieldLabelText_otpSigninUserRef
source: Enter your phone number or email
it: Inserisci il tuo numero di telefono o la tua email
uk: Введіть свій номер телефону чи електронну пошту

# login_TextFieldLabelText_passwordSigninPassword
source: Enter your password
it: Inserisci la tua password
uk: Введіть ваш пароль

# login_TextFieldLabelText_passwordSigninUserRef
source: Enter your phone number or email
it: Inserisci il tuo numero di telefono o la tua email
uk: Введіть свій номер телефону чи електронну пошту

# login_TextFieldLabelText_signupCode
source: Enter the verification code
it: Inserisci il codice di verifica
uk: Введіть код підтвердження

# login_TextFieldLabelText_signupEmail
source: Enter your email
it: Inserisci la tua mail
uk: Введіть свою електронну пошту

# login_Text_otpSigninVerifyPostDescriptionFromEmail
source: If you do not see an email with the verification code from {email} in your inbox, please check your spam folder.
it: Se non vedi un’email con il codice di verifica da {email} nella tua casella di posta, controlla la cartella dello spam.
uk: Якщо ви не бачите електронного листа з кодом підтвердження від {email} у своїй скриньці вхідних, будь ласка, перевірте папку "Спам".

# login_Text_otpSigninVerifyPostDescriptionGeneral
source: If you do not see an email with the verification code in your inbox, please check your spam folder.
it: Se non vedi un'e-mail con il codice di verifica nella tua casella di posta, controlla la cartella della posta indesiderata.
uk: Якщо ви не бачите електронного листа з кодом підтвердження у своїй скринці вхідних, будь ласка, перевірте папку спаму.

# login_Text_otpSigninVerifyPreDescriptionUserRef
source: A one-time verification code was sent to the email assigned to provided phone number or email.
it: Un codice di verifica monouso è stato inviato all'email associata al numero di telefono o all'email fornita.
uk: На електронну пошту, прив'язану до наданого номера телефону чи електронної пошти, надіслано одноразовий код підтвердження.

# login_Text_signupRequestPostDescriptionDemo
source: If you do not have an account yet, it will be automatically created for you
it: Se non hai ancora un account, questo verrà automaticamente creato
uk: Якщо у вас ще немає облікового запису, він буде автоматично створений

# login_Text_signupVerifyPostDescriptionFromEmail
source: If you do not see an email with the verification code from {email} in your inbox, please check your spam folder.
it: Se non vedi un'email con il codice di verifica da {email} nella tua casella di posta in arrivo, controlla nella cartella dello spam.
uk: Якщо ви не бачите електронного листа з кодом підтвердження від {email} у своїй скриньці вхідних, будь ласка, перевірте папку "Спам".

# login_Text_signupVerifyPostDescriptionGeneral
source: If you do not see an email with the verification code in your inbox, please check your spam folder.
it: Se non vedi un'e-mail con il codice di verifica nella tua casella di posta, controlla la cartella della posta indesiderata.
uk: Якщо ви не бачите електронного листа з кодом підтвердження у своїй скринці вхідних, будь ласка, перевірте папку спаму.

# login_Text_signupVerifyPreDescriptionEmail
source: A one-time verification code was sent to {email}.
it: Il codice di verifica temporaneo ti è stato inviato via {email}
uk: На {email} надіслано одноразовий код підтвердження.

# loginType_otpSignin
source: OTP sign in
it: Accesso con OTP
uk: Увійти за OTP

# loginType_passwordSignin
source: Password sign in
it: Accesso con password
uk: Вхід за паролем

# loginType_signup
source: Sign up
it: Iscrizione
uk: Зареєструватися

# login_validationCoreUrlError
source: Please enter a valid URL
it: Prego inserisci un URL valido
uk: Будь ласка, введіть правильний URL

# login_validationEmailError
source: Please enter a valid email
it: Inserire un indirizzo di email valido
uk: Будь ласка, введіть правильну електронну пошту

# login_validationPhoneError
source: Please enter a valid phone number
it: Inserire un numero di telefono valido
uk: Будь ласка, введіть правильний номер телефону

# login_validationUserRefError
source: Please enter a valid phone number or email
it: Per favore, inserisci un numero di telefono o un'email valida
uk: Будь ласка, введіть правильний номер телефону чи електронну пошту

# logRecordsConsole_AppBarTitle
source: Log Console
it: Console dei log
uk: Консоль журналу

# logRecordsConsole_Button_failureRefresh
source: Refresh
uk: Оновити

# logRecordsConsole_Text_failure
source: An unexpected error occurred
it: Si è verificato un errore imprevisto
uk: Виникла неочікувана помилка

# main_BottomNavigationBarItemLabel_chats
source: Chats
it: Le chat
uk: Чати

# main_BottomNavigationBarItemLabel_contacts
source: Contacts
it: Contatti
uk: Контакти

# main_BottomNavigationBarItemLabel_favorites
source: Favorites
it: Favoriti
uk: Обрані

# main_BottomNavigationBarItemLabel_keypad
source: Keypad
it: Tastiera
uk: Клавіатура

# main_BottomNavigationBarItemLabel_recents
source: Recents
it: Recenti
uk: Останні

# main_CompatibilityIssueDialogActions_logout
source: Logout
it: Esci
uk: Вийти

# main_CompatibilityIssueDialogActions_update
source: Update
it: Aggiornamento
uk: Оновити

# main_CompatibilityIssueDialog_contentCoreVersionUnsupportedExceptionError
source: Incompatible WebTrit Cloud Backend version, please contact the administrator of your system. Instance version: {actual} Supported version: {supportedConstraint}
it: Versione di WebTrit Cloud Backend incompatibile, si prega di contattare l'amministratore del sistema. Versione dell'istanza: {actual} Versione supportata: {supportedConstraint}
uk: Несумісна версія WebTrit Cloud Backend, будь ласка, зв'яжіться з адміністратором вашої системи. Версія екземпляру: {actual} Підтримувана версія: {supportedConstraint}

# main_CompatibilityIssueDialog_title
source: Compatibility issue
it: Problema di compatibilità
uk: Проблема сумісності

# messaging_ActionBtn_retry
source: Retry
it: Riprova
uk: Повторить спробу

# messaging_ChooseContact_cancel
source: Cancel
it: Cancellare
uk: Скасувати

# messaging_ChooseContact_empty
source: No contacts found
it: Nessun contatto trovato
uk: Контакти не знайдено

# messaging_ChooseContact_title
source: Choose contact:
it: Scegli il contatto:
uk: Виберіть контакт:

# messaging_ConfirmDialog_ask
source: Are you sure?
it: SÌ?
uk: Ви впевнені?

# messaging_ConfirmDialog_cancel
source: No
uk: Ні

# messaging_ConfirmDialog_confirm
source: Yes
it: SÌ
uk: Так

# messaging_ConversationBuilders_back
source: Back
it: Dopo
uk: Назад

# messaging_ConversationBuilders_cancel
source: Cancel
it: Cancellare
uk: Скасувати

# messaging_ConversationBuilders_contactOrNumberSearch_hint
source: Enter name or phone number
it: Inserisci nome o numero di telefono
uk: Введіть ім'я або номер телефону

# messaging_ConversationBuilders_contactSearch_hint
source: Search contacts
it: Cerca contatti
uk: Пошук контактів

# messaging_ConversationBuilders_create
source: Create
it: Creare
uk: Створити

# messaging_ConversationBuilders_createGroup
source: Create group
it: Crea gruppo
uk: Створити групу

# messaging_ConversationBuilders_externalContacts_heading
source: Cloud PBX contacts
it: Contatti Cloud PBX
uk: Контакти Хмарної АТС

# messaging_ConversationBuilders_invalidNumber_message1
source: The contact has an invalid phone number. It should be in the format
it: Il tsontact ha un numero di telefono non valido. Dovrebbe essere nel formato
uk: Контакт має недійсний номер телефону. Він має бути у форматі

# messaging_ConversationBuilders_invalidNumber_message2
source: . Please fix it in your phone book.
it: . Per favore, lo trovi nella nostra rubrica.
uk: . Будь ласка, виправте це у своїй телефонній книзі.

# messaging_ConversationBuilders_invalidNumber_ok
source: Close
it: Tslose
uk: Закрити

# messaging_ConversationBuilders_invalidNumber_title
source: Invalid phone number
it: Numero di telefono disabilitato
uk: Невірний номер телефону

# messaging_ConversationBuilders_invite_heading
source: Invite users:
it: Invita utenti:
uk: Запросити користувачів:

# messaging_ConversationBuilders_localContacts_heading
source: Local contacts
it: Contatti locali
uk: Локальні контакти

# messaging_ConversationBuilders_membersHeadline
source: Members
it: Membri
uk: Члени групи

# messaging_ConversationBuilders_nameFieldEmpty
source: Please enter a group name
it: Inserisci un nome di gruppo
uk: Будь ласка, введіть назву групи

# messaging_ConversationBuilders_nameFieldLabel
source: Group Name
it: Nome del gruppo
uk: Назва групи

# messaging_ConversationBuilders_nameFieldShort
source: Group name must be at least 3 characters
it: Il nome del gruppo deve essere composto da almeno 3 caratteri
uk: Назва групи має містити не менше 3 символів

# messaging_ConversationBuilders_next_action
source: Next
it: Prossima
uk: Далі

# messaging_ConversationBuilders_noContacts
source: There are no contacts matching the search result
it: Non ci sono contatti che corrispondono al risultato della ricerca
uk: Немає контактів, що відповідають результату пошуку

# messaging_ConversationBuilders_numberFormatExample
source: + [country code] [area/operator code] [subscriber number]
it: + [prefisso nazionale] [prefisso operatore] [numero abbonato]
uk: + [код країни] [код регіону/оператора] [номер абонента]

# messaging_ConversationBuilders_numberSearch_errorError
source: The entered phone number is invalid. It should be entered in the format:
it: Il numero di telefono inserito non è valido. Deve essere inserito nel formato:
uk: Введений номер телефону недійсний. Його слід ввести у форматі:

# messaging_ConversationBuilders_numberSearch_errorHint
source: Phone number format:
it: Formato del numero di telefono:
uk: Формат номера телефону:

# messaging_ConversationBuilders_title_group
source: Create group
it: Crea gruppo
uk: Створити групу

# messaging_ConversationBuilders_title_new
source: New chat
it: Nuova chat
uk: Новий чат

# messaging_Conversation_failure
source: Conversation load error
it: Errore di caricamento della conversazione
uk: Помилка завантаження розмови

# messaging_ConversationScreen_titlePrefix
source: Dialog:
it: Dialogo:
uk: Діалог:

# messaging_ConversationsScreen_chatsSearch_hint
source: Enter chat or user name
it: Inserisci il nome della chat o dell'utente
uk: Введіть ім'я чату або користувача

# messaging_ConversationsScreen_empty
source: No conversations started yet
it: Nessuna conversazione è ancora iniziata
uk: Немає переписок

# messaging_ConversationsScreen_messages_title
source: Messages
it: Messaggi
uk: Повідомлення

# messaging_ConversationsScreen_noNumberAlert_text
source: You need to have a phone number linked to you account to send SMS messages
it: Per inviare messaggi SMS è necessario avere un numero di telefono collegato al tuo account
uk: Щоб надсилати SMS-повідомлення, потрібно мати номер телефону, прив’язаний до вашого облікового запису

# messaging_ConversationsScreen_noNumberAlert_title
source: No phone number
it: Nessun numero di telefono
uk: Немає номера телефону

# messaging_ConversationsScreen_selectNumberSheet_title
source: Select a number
it: Seleziona un numero
uk: Виберіть номер

# messaging_ConversationsScreen_smssSearch_hint
source: Enter phone number
it: Inserisci il numero di telefono
uk: Введіть номер телефону

# messaging_ConversationsScreen_unsupported
source: Messaging is not supported by remote system, please contact your administrator to enable it
it: La messaggistica non è supportata dal sistema remoto, contattare l'amministratore per abilitarla
uk: Обмін повідомленнями не підтримується віддаленою системою. Зверніться до адміністратора, щоб увімкнути його

# messaging_Conversations_tile_empty
source: No messages yet
it: Nessun messaggio ancora
uk: Поки немає повідомлень

# messaging_Conversations_tile_you
source: You
it: Voi
uk: Ви

# messaging_DialogInfo_deleteAsk
source: Are you sure you want to delete this dialog?
it: Sei sicuro di voler eliminare questa finestra di dialogo?
uk: Ви впевнені, що хочете видалити цей діалог?

# messaging_DialogInfo_deleteBtn
source: Delete dialog
it: Elimina dialogo
uk: Видалити діалог

# messaging_DialogInfo_title
source: Contact info
it: Informazioni contatto
uk: Контактна інформація

# messaging_GroupAuthorities_moderator
source: moderator
it: moderatore
uk: модератор

# messaging_GroupAuthorities_noauthorities
source: member
it: membro
uk: учасник

# messaging_GroupAuthorities_owner
source: owner
it: proprietario
uk: власник

# messaging_GroupInfo_addUserBtnText
source: Add user
it: Aggiungi utente
uk: Додати користувача

# messaging_GroupInfo_deleteLeaveBtnText
source: Delete and leave
it: Elimina e lascia
uk: Видалити і залишити

# messaging_GroupInfo_groupMembersHeadline
source: Group members
it: Membri del gruppo
uk: Члени групи

# messaging_GroupInfo_leaveAndDeleteAsk
source: Are you sure you want leave and delete this group?
it: Vuoi davvero uscire ed eliminare questo gruppo?
uk: Ви впевнені, що бажаєте вийти та видалити цю групу?

# messaging_GroupInfo_leaveAsk
source: Are you sure you want to leave this group?
it: Sei sicuro di voler abbandonare questo gruppo?
uk: Ви впевнені, що бажаєте залишити цю групу?

# messaging_GroupInfo_leaveBtnText
source: Leave group
it: Lascia il gruppo
uk: Вийти з групи

# messaging_GroupInfo_makeModeratorAsk
source: Are you sure you want to make this user a moderator?
it: Sei sicuro di voler rendere questo utente un moderatore?
uk: Ви впевнені, що хочете зробити цього користувача модератором?

# messaging_GroupInfo_makeModeratorBtnText
source: Make moderator
it: Rendi moderatore
uk: Зробити модератором

# messaging_GroupInfo_removeModeratorAsk
source: Are you sure you want to remove this user from moderators?
it: Sei sicuro di voler rimuovere questo utente dai moderatori?
uk: Ви впевнені, що хочете видалити цього користувача з модераторів?

# messaging_GroupInfo_removeUserAsk
source: Are you sure you want to remove this user from the group?
it: Vuoi davvero rimuovere questo utente dal gruppo?
uk: Ви впевнені, що хочете видалити цього користувача з групи?

# messaging_GroupInfo_removeUserBtnText
source: Remove
it: Rimuovere
uk: Видалити

# messaging_GroupInfo_title
source: Group info
it: Informazioni sul gruppo
uk: Інформація про групу

# messaging_GroupInfo_titlePrefix
source: Group:
it: Gruppo:
uk: Група:

# messaging_GroupInfo_unmakeModeratorBtnText
source: Unmake moderator
it: Annulla moderatore
uk: Прибрати модератора

# messaging_MessageField_hint
source: Type a message
it: Scrivi un messaggio
uk: Введіть повідомлення

# messaging_MessageListView_typingTrail
source: is typing...
it: stampe...
uk: друкує...

# messaging_MessageView_delete
source: Delete
it: Eliminare
uk: Видалити

# messaging_MessageView_deleted
source: [deleted]
it: [cancellato]
uk: [видалено]

# messaging_MessageView_edit
source: Edit
it: Modificare
uk: Редагувати

# messaging_MessageView_edited
source: [edited]
it: [modificato]
uk: [відредаговано]

# messaging_MessageView_forward
source: Forward
it: Inoltrare
uk: Переслати

# messaging_MessageView_reply
source: Reply
it: Rispondere
uk: Відповісти

# messaging_MessageView_textcopy
source: Copy to clipboard
it: Copia negli appunti
uk: Копіювати в буфер обміну

# messaging_ParticipantName_you
source: You
it: Voi
uk: Ви

# messaging_SmsSendingStatus_delivered
source: delivered
it: consegnato
uk: доставлено

# messaging_SmsSendingStatus_failed
source: failed
it: fallito
uk: не вдалося

# messaging_SmsSendingStatus_sent
source: sent
it: inviato
uk: надіслано

# messaging_SmsSendingStatus_waiting
source: waiting
it: inatteso
uk: очікування

# messaging_StateBar_connecting
source: CONNECTING
it: CONNESSIONE
uk: ПІДКЛЮЧЕННЯ

# messaging_StateBar_error
source: DISCONNECTED
it: DISCONNESSO
uk: ВІДКЛЮЧЕНО

# messaging_StateBar_initializing
source: INITIALIZING
it: INIZIALIZZAZIONE
uk: ІНІЦІАЛІЗАЦІЯ

# notifications_errorSnackBarAction_callUserMedia
source: Check
it: Verifica
uk: Перевірити

# notifications_errorSnackBar_activeLineBlindTransferWarning
source: You are already on the line with the recipient you are trying to blind transfer to
it: Sei già in linea con il destinatario a cui stai cercando di trasferire alla cieca
uk: Ви вже на лінії з одержувачем, до якого намагаєтеся здійснити безумовний переказ

# notifications_errorSnackBar_appOffline
source: Your application is currently offline
uk: Ваш додаток зараз офлайн.

# notifications_errorSnackBar_appOnline
source: Your application is online
uk: Ваш додаток онлайн.

# notifications_errorSnackBar_appUnregistered
source: Sorry, your application is currently disconnected from the WebTrit core servers and hence can't call right now. Please go to the settings page, and slide the online status toggle switch off and on again to reestablish the connection
uk: Вибачте, ваш додаток наразі відключений від серверів WebTrit і не може здійснювати дзвінки. Будь ласка, перейдіть на сторінку налаштувань і перемкніть вимикач стану онлайн у вимкнуте та знову в увімкнуте положення, щоб відновити з'єднання.

# notifications_errorSnackBar_callConnect
source: Connecting to the core failed, trying to reconnect
uk: Підключення до ядра не вдалося, спроба з'єднання

# notifications_errorSnackBar_callSignalingClientNotConnect
source: Cannot initiate the call, please check the connection status
uk: Не вдається ініціювати дзвінок, перевірте статус з'єднання

# notifications_errorSnackBar_callSignalingClientSessionMissed
source: Authentication error, please re-login
uk: Помилка автентифікації, будь ласка увійдіть знову

# notifications_errorSnackBar_callUndefinedLine
source: No idle lines to initiate the call
it: Nessuna linea disponibile per avviare una chiamata
uk: Немає вільних ліній для ініціювання дзвінка

# notifications_errorSnackBar_callUserMedia
source: No access to media input, please check app permissions
it: Nessun accesso al server multimediale, controlla le autorizzazioni dell'app
uk: Немає доступу до медіа-входу, будь ласка, перевірте дозволи програми

# notifications_errorSnackBar_sipServiceUnavailable
source: Authentication error with the remote VoIP system
uk: Помилка аутентифікації з віддаленою VoIP системою

# permission_Button_request
source: Continue
it: Continua
uk: Продовжити

# permission_manageFullScreenNotificationInstructions_step2
source: Navigate to 'Special App Access' under the 'Apps & notifications' section.
uk: Перейдіть у «Спеціальний доступ додатків» у розділі «Додатки та сповіщення».

# permission_manageFullScreenNotificationInstructions_step3
source: Find and tap on 'Manage full screen intents'.
uk: Знайдіть і натисніть «Керування повноекранними намірами».

# permission_manageFullScreenNotificationInstructions_step4
source: Select the app for which you want to manage full-screen notifications.
uk: Виберіть додаток, для якого потрібно керувати повноекранними сповіщеннями.

# permission_manageFullScreenNotificationInstructions_step5
source: Toggle the permission to enable or disable full-screen notifications for that app.
uk: Увімкніть або вимкніть дозвіл для повноекранних сповіщень цього додатка.

# permission_manufacturer_Button_gotIt
source: Got it
it: Capito
uk: Зрозуміло

# permission_manufacturer_Button_toSettings
source: Open app Settings
it: Apri Impostazioni
uk: Відкрийте налаштування програми

# permission_manufacturer_Text_heading
source: To ensure the best user experience, the app needs to be granted the following permissions manually:
it: Per garantire la migliore esperienza utente, l'applicazione deve essere autorizzata manualmente ai seguenti permessi:
uk: Щоб забезпечити найкращу взаємодію з користувачем, програмі потрібно вручну надати такі дозволи:

# permission_manufacturer_Text_trailing
source: Permissions could be changed at any time in the future.
it: I permessi potrebbero essere modificati in qualsiasi momento in futuro.
uk: Дозволи можуть бути змінені в будь-який час у майбутньому.

# permission_manufacturer_Text_xiaomi_tip1
source: Go to "App settings" → "Notifications".
it: Vai su "Impostazioni dell'app" → "Notifiche".
uk: Перейдіть у «Налаштування програми» → «Сповіщення».

# permission_manufacturer_Text_xiaomi_tip2
source: Find and turn on "Lockscreen notifications".
it: Trova e attiva "Notifiche sulla schermata di blocco".
uk: Знайдіть і ввімкніть «Сповіщення на екрані блокування».

# permission_Text_description
source: To ensure the best user experience, the app needs to be granted the following permissions: microphone for audio calls, camera for video calls, and contacts to simplify reaching them from the app. Permissions could be changed at any time in the future.
it: Per garantire la migliore esperienza utente, all'app devono essere concesse le seguenti autorizzazioni: microfono per le chiamate audio, fotocamera per le videochiamate e contatti per semplificare il raggiungimento degli utenti dall'app. Le autorizzazioni possono essere modificate in qualsiasi momento anche successivamente.
uk: Для забезпечення найкращого досвіду користувача програма потребує наступні дозволи: мікрофон для аудіодзвінків, камера для відеодзвінків та доступ до контактів для спрощення їх використання в програмі. Дозволи можуть бути змінені у майбутньому.

# recents_BodyCenter_empty
source: Currently you have no {filter}recent calls.
it: Attualmente non hai chiamate recenti con {filter}.
uk: Зараз у вас немає жодних {filter} останніх дзвінків.
