Repository: WebTrit/webtrit_phone
Catalog: lib/l10n/arb/app_*.arb
Languages: it, uk

# recents_DeleteConfirmDialog_content
source: Are you sure you want to delete the current call log?
it: Sei sicuro di voler eliminare il registro chiamate attuale?
uk: Ви впевнені, що хочете видалити поточний журнал дзвінків?

# recents_DeleteConfirmDialog_title
source: Confirm deleting
it: Confermare l'eliminazione
uk: Підтвердження видалення

# recents_HistoryTile_missedCallText
source: Missed
it: Chiamata persa
uk: Пропущено

# recents_snackBar_deleted
source: {name} deleted
it: {name} cancellato
uk: {name} видалено

# recents_Text_blingTransferInitiated
source: Performing blind transfer
it: Trasferimento senza vedere
uk: Безумовне переведення дзвінка

# recentsVisibilityFilter_all
source: All
it: Tutto
uk: Всі

# recentsVisibilityFilter_all_preposit
source: all
it: tutto
uk: всі

# recentsVisibilityFilter_incoming
source: Incoming
it: Entrante
uk: Вхідні

# recentsVisibilityFilter_incoming_preposit
source: incoming
it: in arrivo
uk: вхідні

# recentsVisibilityFilter_missed
source: Missed
it: Perse
uk: Пропущені

# recentsVisibilityFilter_missed_preposit
source: missed
it: perso
uk: пропущені

# recentsVisibilityFilter_outgoing
source: Outgoing
it: Uscente
uk: Вихідні

# recentsVisibilityFilter_outgoing_preposit
source: outgoing
it: in uscita
uk: вихідні

source: Request id
it: ID richiesta
uk: Ідентифікатор запиту

# request_StatusCode
source: Status code
it: Codice di stato
uk: Код статусу запиту

# sessionStatus_pushNotificationServiceProblem
source: Problem with configuration push notification service
it: Problema con la configurazione del servizio di notifiche push
uk: Проблема з налаштуванням служби пуш-сповіщень

# settings_AboutText_AppVersion
source: App Version
it: Versione dell'app
uk: Версія додатка

# settings_AboutText_FCMPushNotificationToken
source: FCM Push Notification Token
it: Token di Notifica Push FCM
uk: Токен для Push-повідомлень FCM

# settings_AboutText_StoreVersion
source: Build version in the Store
it: La nuova versione è disponibile nello Store
uk: Версія збірки в магазині

# settings_AccountDeleteConfirmDialog_content
source: Are you sure you want to delete account?
it: Sei sicuro di voler eliminare l'account?
uk: Ви впевнені, що хочете видалити обліковий запис?

# settings_AccountDeleteConfirmDialog_title
source: Confirm delete account
it: Conferma eliminazione account
uk: Підтвердіть видалення облікового запису

# settings_AppBarTitle_myAccount
source: My account
it: Il mio account
uk: Мій обліковий запис

# settings_call_codecs_preferred_audio_default
source: Auto
uk: Автоматично

# settings_call_codecs_preferred_audio_tip
source: The preferred audio codec is used for audio calls. If the codec is not supported by device, the call will be established using the next available codec.
uk: Використовується для аудіодзвінків. Якщо кодек не підтримується пристроєм, дзвінок буде встановлено за допомогою наступного доступного кодеку.

# settings_call_codecs_preferred_audio_title
source: Preferred audio codec
uk: Бажаний аудіокодек

# settings_call_codecs_preferred_video_default
source: Auto
uk: Автоматично

# settings_call_codecs_preferred_video_tip
source: The preferred video codec is used for video calls. If the codec is not supported by device, the call will be established using the next available codec.
uk: Використовується для відеодзвінків. Якщо кодек не підтримується пристроєм, дзвінок буде встановлено за допомогою наступного доступного кодеку.

# settings_call_codecs_preferred_video_title
source: Preferred video codec
uk: Бажаний відеокодек

# settings_ListViewTileTitle_about
source: About
it: Riguardo a
uk: Про програму

# settings_ListViewTileTitle_accountDelete
source: Delete account
it: Elimina account
uk: Видалити обліковий запис

# settings_ListViewTileTitle_help
source: Help
it: Aiuto
uk: Допомога

# settings_ListViewTileTitle_language
source: Language
it: Linguaggio
uk: Мова

# settings_ListViewTileTitle_logout
source: Logout
it: Esci
uk: Вийти

# settings_ListViewTileTitle_logRecordsConsole
source: Log records console
it: Console dei registri di log
uk: Консоль записів журналу

# settings_ListViewTileTitle_network
source: Network settings
it: Impostazioni di rete
uk: Налаштування мережі

# settings_ListViewTileTitle_registered
source: Online
it: Registrato
uk: Зареєстровано

# settings_ListViewTileTitle_settings
source: SETTINGS
it: IMPOSTAZIONI
uk: НАЛАШТУВАННЯ

# settings_ListViewTileTitle_termsConditions
source: Terms and conditions
it: Termini e condizioni
uk: Умови та положення

# settings_ListViewTileTitle_themeMode
source: Theme mode
it: Modalità tema
uk: Режим теми

# settings_ListViewTileTitle_toolbox
source: TOOLBOX
uk: ІНСТРУМЕНТИ

# settings_LogoutConfirmDialog_content
source: Are you sure you want to logout?
it: Sei sicuro di voler uscire?
uk: Ви впевнені, що хочете вийти?

# settings_LogoutConfirmDialog_title
source: Confirm logout
it: Confermare la disconnessione
uk: Підтвердження виходу

# settings_network_incomingCallType_pushNotification_description
source: When the app is not in use, it stops running and consumes minimal resources, which helps conserve battery life. During an incoming call, the server sends a push notification to the phone, prompting the mobile operating system to launch the app to handle the call. However, this method does not guarantee that all calls will be received. If the phone has been inactive for an extended period, some versions of Android may limit push notifications, potentially causing you to miss an incoming call.
it: Quando l'app non è in uso, smette di funzionare e consuma risorse minime, il che aiuta a conservare la durata della batteria. Durante una chiamata in arrivo, il server invia una notifica push al telefono, spingendo il sistema operativo mobile a lanciare l'app per gestire la chiamata. Tuttavia, questo metodo non garantisce che tutte le chiamate verranno ricevute. Se il telefono è stato inattivo per un periodo prolungato, alcune versioni di Android potrebbero limitare le notifiche push, con il rischio di perdere una chiamata in arrivo.
uk: Коли додаток не використовується, він зупиняється і споживає мінімальну кількість ресурсів, що допомагає заощаджувати заряд батареї. Під час вхідного дзвінка сервер <brand> надсилає push-сповіщення на телефон, після чого мобільна операційна система запускає додаток для обробки дзвінка. Однак цей метод не гарантує отримання всіх дзвінків, оскільки, якщо телефон довго не використовується, деякі версії Android можуть обмежувати отримання push-сповіщень, що може призвести до пропущеного дзвінка.

# settings_network_incomingCallType_pushNotification_title
source: Push Notification
it: Notifica Push
uk: Push-сповіщення

# settings_network_incomingCallType_socket_description
source: The app continues running in the background and always maintains an active connection to the server. This increases the chances of receiving an incoming call but may drain the battery more quickly.
it: L'app continua a funzionare in background e mantiene sempre una connessione attiva al server. Questo aumenta le probabilità di ricevere una chiamata in arrivo, ma potrebbe scaricare la batteria più rapidamente.
uk: Додаток продовжує працювати у фоновому режимі та завжди підтримує активне підключення до сервера. Це збільшує шанси отримати вхідний дзвінок, але може швидше розряджати батарею.

# settings_network_incomingCallType_socket_title
source: Persistent Connection to the Server
it: Connessione Persistente al Server
uk: Постійне підключення до сервера

# settings_network_incomingCallType_title
source: Incoming Call Type
it: Tipo di chiamata in entrata
uk: Тип вхідного дзвінка

# signalingResponseCode_errorAttachingPlugin
source: We had trouble connecting a feature. Please try again later.
it: Abbiamo avuto problemi a connettere una funzione. Riprova più tardi.
uk: Не вдалося підключити функцію. Будь ласка, спробуйте пізніше.

# signalingResponseCode_errorDetachingPlugin
source: We had trouble disconnecting a feature. Please try again later.
it: Abbiamo avuto problemi a disconnettere una funzione. Riprova più tardi.
uk: Не вдалося відключити функцію. Будь ласка, спробуйте пізніше.

# signalingResponseCode_errorSendingMessage
source: We couldn't send your message. Check your network and try again.
it: Non siamo riusciti a inviare il tuo messaggio. Controlla la rete e riprova.
uk: Не вдалося надіслати повідомлення. Перевірте з’єднання з мережею та спробуйте ще раз.

# signalingResponseCode_handleNotFound
source: We couldn't find what you were looking for. Please try again.
it: Non abbiamo trovato ciò che stavi cercando. Riprova.
uk: Не вдалося знайти необхідний елемент. Будь ласка, спробуйте ще раз.

# signalingResponseCode_invalidElementType
source: Something isn't quite right. Please try again.
it: Qualcosa non va. Riprova.
uk: Щось пішло не так. Будь ласка, спробуйте ще раз.

# signalingResponseCode_invalidJson
source: There was an error processing your data. Please try again.
it: Si è verificato un errore nell'elaborazione dei tuoi dati. Riprova.
uk: Сталася помилка під час обробки ваших даних. Будь ласка, спробуйте ще раз.

# signalingResponseCode_invalidJsonObject
source: Some of the information provided was not valid. Please double-check and try again.
it: Alcune delle informazioni fornite non sono valide. Verifica e riprova.
uk: Деякі надані дані є недійсними. Будь ласка, перевірте їх і спробуйте ще раз.

# signalingResponseCode_invalidPath
source: The requested action isn't available. Please try a different option.
it: L'azione richiesta non è disponibile. Prova un'opzione diversa.
uk: Запитувана дія недоступна. Будь ласка, спробуйте інший варіант.

# signalingResponseCode_invalidSdp
source: We encountered a technical error. Please try again later.
it: Si è verificato un errore tecnico. Riprova più tardi.
uk: Виникла технічна помилка. Будь ласка, спробуйте пізніше.

# signalingResponseCode_invalidStream
source: The requested stream isn't available. Please try again.
it: Lo stream richiesto non è disponibile. Riprova.
uk: Запитаний потік недоступний. Будь ласка, спробуйте ще раз.

# signalingResponseCode_missingMandatoryElement
source: Required information is missing. Please fill in all required fields.
it: Mancano informazioni obbligatorie. Compila tutti i campi richiesti.
uk: Не вистачає необхідної інформації. Будь ласка, заповніть усі обов’язкові поля.

# signalingResponseCode_missingRequest
source: Something went wrong with your request. Please try again.
it: C'è stato un problema con la tua richiesta. Riprova.
uk: Щось пішло не так із вашим запитом. Будь ласка, спробуйте ще раз.

# signalingResponseCode_notAcceptingNewSessions
source: We're not able to start new sessions at the moment. Please try later.
it: Non siamo in grado di avviare nuove sessioni al momento. Riprova più tardi.
uk: Ми не можемо розпочати нові сесії зараз. Будь ласка, спробуйте пізніше.

# signalingResponseCode_notFoundRoutesInReplyFromBE
source: We couldn't find a route to complete your request. Please try again later.
it: Non abbiamo trovato un percorso per completare la tua richiesta. Riprova più tardi.
uk: Ми не змогли знайти маршрут для виконання вашого запиту. Будь ласка, спробуйте пізніше.

# signalingResponseCode_pluginNotFound
source: A required component is missing. Please try restarting the app.
it: Manca un componente necessario. Prova a riavviare l'app.
uk: Не знайдено необхідного компонента. Спробуйте перезапустити додаток.

# signalingResponseCode_sessionIdInUse
source: This session is already active. Try using a different session.
it: Questa sessione è già attiva. Prova a usarne un'altra.
uk: Ця сесія вже активна. Спробуйте використати іншу.

# signalingResponseCode_sessionNotFound
source: Your session could not be found. Please sign in and try again.
it: Non è stata trovata la tua sessione. Effettua l'accesso e riprova.
uk: Не вдалося знайти вашу сесію. Будь ласка, увійдіть у систему та спробуйте ще раз.

# signalingResponseCode_tokenNotFound
source: Your access token is missing or invalid. Please sign in again.
it: Il tuo token di accesso è mancante o non valido. Effettua nuovamente l'accesso.
uk: Ваш токен доступу відсутній або недійсний. Будь ласка, увійдіть у систему знову.

# signalingResponseCode_transportSpecificError
source: A connection issue occurred. Please check your network and try again.
it: Si è verificato un problema di connessione. Controlla la tua rete e riprova.
uk: Виникла проблема із підключенням. Перевірте свою мережу та спробуйте ще раз.

# signalingResponseCodeType_plugin
source: A required feature isn't working properly. Try restarting the app.
it: Una funzionalità necessaria non sta funzionando correttamente. Prova a riavviare l'app.
uk: Не працює необхідна функція. Спробуйте перезапустити додаток.

# signalingResponseCodeType_request
source: There's an issue with your request. Please try again.
it: C'è un problema con la tua richiesta. Riprova.
uk: Сталася помилка у вашому запиті. Будь ласка, спробуйте ще раз.

# signalingResponseCodeType_session
source: There's an issue with your session. Please sign in again or restart the app.
it: C'è un problema con la tua sessione. Effettua nuovamente l'accesso o riavvia l'app.
uk: Виникла проблема з вашою сесією. Будь ласка, увійдіть у систему знову або перезапустіть додаток.

# signalingResponseCodeType_token
source: Your access token isn't valid. Please sign in again.
it: Il tuo token di accesso non è valido. Effettua nuovamente l'accesso.
uk: Ваш токен доступу недійсний. Будь ласка, увійдіть у систему знову.

# signalingResponseCodeType_transport
source: We're having trouble communicating with the server. Please check your connection and try again.
it: Stiamo riscontrando difficoltà di comunicazione con il server. Controlla la tua connessione e riprova.
uk: Виникли труднощі з підключенням до сервера. Перевірте з’єднання та спробуйте ще раз.

# signalingResponseCodeType_unauthorized
source: You do not have the proper authorization. Please sign in or contact support.
it: Non hai l'autorizzazione necessaria. Effettua l'accesso o contatta il supporto.
uk: У вас немає належного доступу. Будь ласка, увійдіть у систему або зверніться до служби підтримки.

# signalingResponseCodeType_unknown
source: An unexpected issue occurred. Please try again later.
it: Si è verificato un problema imprevisto. Riprova più tardi.
uk: Сталася несподівана помилка. Будь ласка, спробуйте пізніше.

# signalingResponseCodeType_webrtc
source: There's an issue with the call connection. Please hang up and try again.
it: C'è un problema con la connessione della chiamata. Riaggancia e riprova.
uk: Виникла проблема з підключенням дзвінка. Завершіть дзвінок і спробуйте знову.

# signalingResponseCode_unauthorizedAccess
source: You do not have permission to access this feature. Please contact support if you believe this is an error.
it: Non hai l'autorizzazione per accedere a questa funzione. Contatta il supporto se pensi che ci sia un errore.
uk: У вас немає дозволу на доступ до цієї функції. Якщо це помилка, зверніться до служби підтримки.

# signalingResponseCode_unauthorizedRequest
source: Your request could not be authorized. Please try signing in again.
it: La tua richiesta non può essere autorizzata. Prova ad accedere di nuovo.
uk: Не вдалося авторизувати запит. Будь ласка, увійдіть у систему знову.

# signalingResponseCode_unexpectedAnswer
source: We got an unexpected response. Please try again.
it: Abbiamo ricevuto una risposta inaspettata. Riprova.
uk: Отримано несподівану відповідь. Будь ласка, спробуйте ще раз.

# signalingResponseCode_unknownError
source: An unexpected error occurred. Please try again later.
it: Si è verificato un errore imprevisto. Riprova più tardi.
uk: Сталася несподівана помилка. Будь ласка, спробуйте пізніше.

# signalingResponseCode_unknownRequest
source: We didn't recognize that request. Please try again or contact support.
it: Non abbiamo riconosciuto la tua richiesta. Riprova o contatta il supporto.
uk: Запит не розпізнано. Будь ласка, спробуйте ще раз або зверніться до служби підтримки.

# signalingResponseCode_unsupportedJsepType
source: This action isn't supported by your current setup.
it: Questa azione non è supportata dalla tua configurazione attuale.
uk: Ця дія не підтримується вашими поточними налаштуваннями.

# signalingResponseCode_wrongWebrtcState
source: A call-related error occurred. Please hang up and try again.
it: Si è verificato un errore relativo alla chiamata. Riaggancia e riprova.
uk: Сталася помилка, пов’язана з викликом. Завершіть виклик і спробуйте ще раз.

# themeMode_dark
source: Dark
it: Scuro
uk: Темний

# themeMode_light
source: Light
it: Luce
uk: Світлий

# themeMode_system
source: System
it: Sistema
uk: Системний

# user_agreement_agrement_link
source: The terms and conditions of the agreement
it: Termini e condizion
uk: Умови договору

# user_agreement_button_text
source: Continue
it: Continua
uk: Продовжити

# user_agreement_checkbox_text
source: I have read the {url} and consent to its terms.
it: Presa visione dell'{url}, accetto termini e condizioni.
uk: Я прочитав {url} і погоджуюся з умовами

# user_agreement_description
source: Welcome to {appName}
it: Benvenuto in {appName}
uk: Ласкаво просимо до {appName}

# validationBlankError
source: Please enter a value
it: Prego inserire un valore
uk: Будь ласка, введіть значення
